app/graphql/mutations/companies/add_company.rb

      def resolve(params:)
        company_params = Hash params

        begin
          company = Company.create!(company_params)
---
INSERT INTO "companies" ("name", "cnpj", "foundation", "foundator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Firma Fabio2"], ["cnpj", 12345], ["foundation", "20/02/1997"], ["foundator_id", 1], ["created_at", "2020-11-03 23:05:37.435072"], ["updated_at", "2020-11-03 23:05:37.435072"]]