app/graphql/mutations/employees/remove_employee.rb

      def resolve(id:)
        employee = Employee.find(id)
        employee.destroy!
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 11]]