app/graphql/mutations/employees/update_employee.rb

      def resolve(params)
        employee = Employee.find(params[:id])
        params_update = params.except(:id)

        employee.update!(params_update)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "employees" SET "name" = $1, "surname" = $2, "age" = $3, "updated_at" = $4 WHERE "employees"."id" = $5  [["name", "Batata"], ["surname", "Soares"], ["age", 23], ["updated_at", "2020-11-03 17:16:04.756652"], ["id", 2]]