app/views/companies/index.html.erb

          <td><%= link_to 'Editar', edit_company_path(company['cnpj']) %></td>
          <td><%= link_to "Deletar", Company.where(cnpj: company['cnpj']).first, method: "delete" %></td>
---
SELECT "companies".* FROM "companies" WHERE "companies"."cnpj" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["cnpj", 1241], ["LIMIT", 1]]