app/views/companies/new.html.erb

      <%= label_tag :system, 'Fundador:' %>
      <%= select_tag(
        'company[foundator_id]',
        options_for_select(Foundator.all.map(&:name)),
        prompt: 'Selecione um Fundador',
        class: 'form-control type_select'
      ) %>
---
SELECT "foundators".* FROM "foundators"