app/graphql/queries/fetch_company.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def resolve(id:)
      Company.find(id)