app/graphql/queries/fetch_foundator.rb

SELECT "foundators".* FROM "foundators" WHERE "foundators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def resolve(id:)
      Foundator.find(id)