app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def update
    query = 'query {
      fetchCompanies {
        name
        cnpj
        foundation
        foundatorId
        id
      }
    }'

    client = ClientGraphql.new(query)
    response = client.call

    @companies = response.original_hash['data']['fetchCompanies']
    company_id = companies.select { |x| x['cnpj'] == params['cnpj'].to_i }.first['id']

SELECT "companies".* FROM "companies" WHERE "companies"."cnpj" IS NULL ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def edit
    query = 'query {
      fetchCompanies {
        name
        cnpj
        foundation
        foundatorId
      }
    }'

    client = ClientGraphql.new(query)
    response = client.call

    #TODO
    # melhorar essa query
    #ENDTODO
    companies = response.original_hash['data']['fetchCompanies']
    @company = companies.select { |x| x['cnpj'] == params['id'].to_i }.first