app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."cnpj" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["cnpj", 1241], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 24]]
---
  def show
    #TODO
    # melhorar essa gambiarra pois deve ser no método destroy ksksks
    #ENDTODO
    company =  Company.where(cnpj: params['format']).first
    company.destroy

SELECT "foundators".* FROM "foundators" WHERE "foundators"."name" = $1 ORDER BY "foundators"."id" ASC LIMIT $2  [["name", "Fabio 2"], ["LIMIT", 1]]
---
  def create
    foundator = Foundator.where(name: company_params[:foundator_id]).first